let name = ["Дома", "Фермы", "Шахты", "Лесопилки", "Дом лекаря", "Дом инженеров", "Хижина Шамана"];
let text = ["Из дома каждый день появляется 3 человек. Не спрашивайте, как они это делают",
            "Ферма добывает по 5 еды в день. Очень эффективное и хорошое здание",
            "Шахты добывают по 2 камня в день. Наши ученые заявляют, что если добывать много камня, то шансы на то, что будет землетрясение будут расти",
            "Лесопилка добывают по 4 дерева в день, но будьте осторожны, чем больше вы будете вырубать лес, тем больше боги будут гневаться на вас",
            "Конечно с гигиеной в этих краях все плохо, но будем надеяться, что лекари смогут справиться с эпидемиями",
            "Может эти парни и выглядят недружелюбно, но поверьте, они многое готовы сделать за ящик пива. Например, укрепить ваши строения",
            "Вы сначала не верили им, а потом они вылечили вам больной зуб. Вот так вы и согласились не сжигать их. Посмотрим, может эти чудики умеют и другие фокусы показывать"];
let price = ["10 дерева 10 камня",
             "15 камня 15 дерева",
             "20 камня 10 дерева",
             "10 камня 20 дерева",
             "15 камня 15 дерева",
             "30 камня 20 дерева",
             "10 камня 30 дерева",];


var k = 1;
function newinfo(){
    document.getElementById("info_name_of_building").textContent = name[k];
    document.getElementById("info_text_of_building").textContent = text[k];
    document.getElementById("info_price_of_building").textContent = price[k];
    k++;
    k %= name.length;
}
